-----

# Inner,Left, Right, and Outer Joins

In [1]:
import pandas as pd
import numpy as np

In [2]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [3]:

pd.merge(registrations,logins,how='inner',on='name')

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

In [4]:

pd.merge(registrations,logins,how='inner')

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

## Left Join

In [5]:
pd.merge(registrations,logins,how='left')

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

## Right Join

In [6]:
pd.merge(registrations,logins,how='right')

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0     Bobo       4

## Outer Join

In [7]:
pd.merge(registrations,logins,how='outer')

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

## Join on Index or Column

In [8]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [9]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [10]:
registrations = registrations.set_index("name")

In [11]:
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [12]:
pd.merge(registrations,logins,left_index=True,right_on='name')

   reg_id  log_id    name
1       1       2  Andrew
3       2       4    Bobo

In [13]:
pd.merge(logins,registrations,right_index=True,left_on='name')

   log_id    name  reg_id
1       2  Andrew       1
3       4    Bobo       2

### Dealing with differing key column names in joined tables

In [14]:
registrations = registrations.reset_index()

In [15]:
registrations

     name  reg_id
0  Andrew       1
1    Bobo       2
2  Claire       3
3   David       4

In [16]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [17]:
registrations.columns = ['reg_name','reg_id']

In [18]:
registrations

  reg_name  reg_id
0   Andrew       1
1     Bobo       2
2   Claire       3
3    David       4

In [19]:
# ERROR
# pd.merge(registrations,logins)

In [20]:
pd.merge(registrations,logins,left_on='reg_name',right_on='name')

  reg_name  reg_id  log_id    name
0   Andrew       1       2  Andrew
1     Bobo       2       4    Bobo

In [21]:
pd.merge(registrations,logins,left_on='reg_name',right_on='name').drop('reg_name',axis=1)

   reg_id  log_id    name
0       1       2  Andrew
1       2       4    Bobo

### Pandas automatically tags duplicate columns

In [22]:
registrations.columns = ['name','id']

In [23]:
logins.columns = ['id','name']

In [24]:
registrations

     name  id
0  Andrew   1
1    Bobo   2
2  Claire   3
3   David   4

In [25]:
logins

   id     name
0   1   Xavier
1   2   Andrew
2   3  Yolanda
3   4     Bobo

In [26]:
# _x is for left
# _y is for right
pd.merge(registrations,logins,on='name')

     name  id_x  id_y
0  Andrew     1     2
1    Bobo     2     4

In [27]:
pd.merge(registrations,logins,on='name',suffixes=('_reg','_log'))

     name  id_reg  id_log
0  Andrew       1       2
1    Bobo       2       4

# Text Methods

In [28]:
mystring = 'hello'

In [29]:
mystring.capitalize()

'Hello'

In [30]:
mystring.isdigit()

False

In [31]:
import pandas as pd

In [32]:
names = pd.Series(['andrew','bobo','claire','david','4'])

In [33]:
names

0    andrew
1      bobo
2    claire
3     david
4         4
dtype: object

In [34]:
names.str.capitalize()

0    Andrew
1      Bobo
2    Claire
3     David
4         4
dtype: object

In [35]:
names.str.isdigit()

0    False
1    False
2    False
3    False
4     True
dtype: bool

## Splitting , Grabbing, and Expanding

In [36]:
tech_finance = ['GOOG,APPL,AMZN','JPM,BAC,GS']

In [37]:
len(tech_finance)

2

In [38]:
tickers = pd.Series(tech_finance)

In [39]:
tickers

0    GOOG,APPL,AMZN
1        JPM,BAC,GS
dtype: object

In [40]:
tickers.str.split(',')

0    [GOOG, APPL, AMZN]
1        [JPM, BAC, GS]
dtype: object

In [41]:
tickers.str.split(',').str[0]

0    GOOG
1     JPM
dtype: object

In [42]:
tickers.str.split(',',expand=True)

      0     1     2
0  GOOG  APPL  AMZN
1   JPM   BAC    GS

## Cleaning or Editing Strings

In [43]:
messy_names = pd.Series(["andrew  ","bo;bo","  claire  "])

In [44]:
# Notice the "mis-alignment" on the right hand side due to spacing in "andrew  " and "  claire  "
messy_names

0      andrew
1         bo;bo
2      claire
dtype: object

In [45]:
messy_names.str.replace(";","")

0      andrew
1          bobo
2      claire
dtype: object

In [46]:
messy_names.str.strip()

0    andrew
1     bo;bo
2    claire
dtype: object

In [47]:
messy_names.str.replace(";","").str.strip()

0    andrew
1      bobo
2    claire
dtype: object

In [48]:
messy_names.str.replace(";","").str.strip().str.capitalize()

0    Andrew
1      Bobo
2    Claire
dtype: object

## Alternative with Custom apply() call

In [49]:
def cleanup(name):
    name = name.replace(";","")
    name = name.strip()
    name = name.capitalize()
    return name

In [50]:
messy_names

0      andrew
1         bo;bo
2      claire
dtype: object

In [51]:
messy_names.apply(cleanup)

0    Andrew
1      Bobo
2    Claire
dtype: object

# Time Methods

In [52]:
from datetime import datetime

In [53]:
my_year = 2017
my_month = 1
my_day = 2
my_hour = 13
my_minute = 30
my_second = 15

In [54]:
# January 2nd, 2017
my_date = datetime(my_year,my_month,my_day)

In [55]:
# Defaults to 0:00
my_date

datetime.datetime(2017, 1, 2, 0, 0)

In [56]:
# January 2nd, 2017 at 13:30:15
my_date_time = datetime(my_year,my_month,my_day,my_hour,my_minute,my_second)

In [57]:
my_date_time

datetime.datetime(2017, 1, 2, 13, 30, 15)

You can grab any part of the datetime object you want

In [58]:
my_date.day

2

In [59]:
my_date_time.hour

13

# Pandas

# Converting to datetime

In [60]:
import pandas as pd

In [61]:
myser = pd.Series(['Nov 3, 2000', '2000-01-01', None])

In [62]:
myser

0    Nov 3, 2000
1     2000-01-01
2           None
dtype: object

In [63]:
myser[0]

'Nov 3, 2000'

In [64]:
pd.to_datetime(myser,format='mixed')

0   2000-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [65]:
myser = pd.Series(['Nov 3, 2000', '2000-01-01', None])
converted_dates = pd.to_datetime(myser,format="mixed")
print(converted_dates[0])

2000-11-03 00:00:00

In [66]:
obvi_euro_date = '31-12-2000'

In [67]:
pd.to_datetime(obvi_euro_date)

/tmp/ipykernel_20284/272727512.py:1: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  pd.to_datetime(obvi_euro_date)

Timestamp('2000-12-31 00:00:00')

In [68]:
# 10th of Dec OR 12th of October?
# We may need to tell pandas
euro_date = '10-12-2000'

In [69]:
pd.to_datetime(euro_date)

Timestamp('2000-10-12 00:00:00')

In [70]:
pd.to_datetime(euro_date,dayfirst=True)

Timestamp('2000-12-10 00:00:00')


## Custom Time String Formatting

In [71]:
style_date = '12--Dec--2000'

In [72]:
pd.to_datetime(style_date, format='%d--%b--%Y')

Timestamp('2000-12-12 00:00:00')

In [73]:
strange_date = '12th of Dec 2000'

In [74]:
pd.to_datetime(strange_date)

Timestamp('2000-12-12 00:00:00')

In [75]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv')

In [76]:
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [77]:
sales.iloc[0]['DATE']

'1992-01-01'

In [78]:
type(sales.iloc[0]['DATE'])

str

In [79]:
sales['DATE'] = pd.to_datetime(sales['DATE'])

In [80]:
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [81]:
sales.iloc[0]['DATE']

Timestamp('1992-01-01 00:00:00')

In [82]:
type(sales.iloc[0]['DATE'])

pandas._libs.tslibs.timestamps.Timestamp

In [83]:
# Parse Column at Index 0 as Datetime
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv',parse_dates=[0])

In [84]:
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [85]:
type(sales.iloc[0]['DATE'])

pandas._libs.tslibs.timestamps.Timestamp

## Resample

In [86]:
# Our index
sales.index

RangeIndex(start=0, stop=340, step=1)

In [87]:
# Reset DATE to index

In [88]:
sales = sales.set_index("DATE")

In [89]:
sales

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822
...                   ...
2019-12-01           6630
2020-01-01           4388
2020-02-01           4533
2020-03-01           5562
2020-04-01           5207

[340 rows x 1 columns]

In [90]:
# Yearly Means
sales.resample(rule='A').mean()

/tmp/ipykernel_20284/617153722.py:2: FutureWarning: 'A' is deprecated and will be removed in a future version, please use 'YE' instead.
  sales.resample(rule='A').mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000

In [91]:
sales = sales.reset_index()

In [92]:
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [93]:
sales['DATE'].dt.month

0       1
1       2
2       3
3       4
4       5
       ..
335    12
336     1
337     2
338     3
339     4
Name: DATE, Length: 340, dtype: int32

In [94]:
sales['DATE'].dt.is_leap_year

0       True
1       True
2       True
3       True
4       True
       ...
335    False
336     True
337     True
338     True
339     True
Name: DATE, Length: 340, dtype: bool